DataProcessors/НачальнаяСтраницаЮристы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>НачальнаяСтраницаЮристы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/ПередачаДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПередачаДоговоров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПривязкаДоговор</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Договора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПодгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/НачальнаяСтраницаЮристы/Forms/ФормаЗагрузитьИзФайла/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

    ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбФайла.Заголовок				= "Выберите файл для загрузки:";
	ДиалогВыбФайла.ПолноеИмяФайла			= ИмяФайла; //АДРЕС
	//ДиалогВыбФайла.Фильтр					= "Excel (*.xlsx)|*.xls*";
	//ДиалогВыбФайла.Расширение				= "xlsx";
	ДиалогВыбФайла.МножественныйВыбор		= Ложь;
	ДиалогВыбФайла.ПредварительныйПросмотр	= Ложь;
	ДиалогВыбФайла.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма));
 	

	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДопПарметры) Экспорт
	Если ЗначениеЗаполнено(ВыбранныеФайлы) и ВыбранныеФайлы.Количество() > 0 Тогда
		 ИмяФайла = ВыбранныеФайлы[0];
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(ДвоичныеДанные, Расширение)
	
	   //ФайлДанных = ИмяФайла;
	   
	   ФайлEXCELНаСервере = ПолучитьИмяВременногоФайла(Расширение);
	   ДвоичныеДанные.Записать(ФайлEXCELНаСервере);
	 	    
	   ФайлЕксел.Прочитать(ФайлEXCELНаСервере,СпособЧтенияЗначенийТабличногоДокумента.Текст);
	   УдалитьФайлы(ФайлEXCELНаСервере);

	   
	   
		
	   //ФайлЕксел.Прочитать(ИмяФайла,СпособЧтенияЗначенийТабличногоДокумента.Текст);
		
       ПЗ = Новый ПостроительЗапроса;

	   ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ФайлЕксел.Область());

	   ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;

	   ПЗ.ЗаполнитьНастройки();

	   ПЗ.Выполнить();

	   ТаблицаЗначений = ПЗ.Результат.Выгрузить();

	   
				НовыйДокумент = Документы.ПередачаДоговоров.СоздатьДокумент();
				
				НовыйДокумент.Автор=Исполнитель;
				
				НовыйДокумент.Дата=ТекущаяДата();
				
				НовыйДокумент.Сотрудник=Исполнитель;

	   
	   
	    Для каждого стр Из ТаблицаЗначений Цикл

		  Если стр.НомерДоговора<>"" Тогда
		  
		  	        строкаТЧ= НовыйДокумент.Договора.Добавить();
				  
				  структураДог=НайтиДоговор(стр.НомерДоговора);
				  строкаТЧ.Договор=структураДог.Договор;
				  строкаТЧ.Должник=структураДог.Должник;
				  
				  Если стр.ДатаПодгрузки<>""  Тогда
				        строкаТЧ.ДатаПодгрузки=СтроковыеФункцииКлиентСервер.СтрокаВДату(стр.ДатаПодгрузки);
				  
				  КонецЕсли;
			  

		  
		  КонецЕсли;
				
							     			  
			
		КонецЦикла;	
	   
		        НачатьТранзакцию();
				Попытка
				
				 НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);	
					
				 ЗафиксироватьТранзакцию();
				Исключение
					
					 ОтменитьТранзакцию();
				КонецПопытки;
				

		
	
	
	
КонецПроцедуры

&НаСервере
Функция НайтиДоговор(дог)

	
	 структураДоговор=Новый Структура;
	 
			       	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			// Данный фрагмент построен конструктором.
			// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Договоры.Владелец КАК Владелец,
				|	Договоры.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Договоры КАК Договоры
				|ГДЕ
				|	Договоры.НомерДоговора = &НомерДоговора";
			
			Запрос.УстановитьПараметр("НомерДоговора", дог);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
				
				структураДоговор.Вставить("Договор",ВыборкаДетальныеЗаписи.Ссылка);
				структураДоговор.Вставить("Должник",ВыборкаДетальныеЗаписи.Владелец);
				
				
			КонецЦикла;
			
			//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	   Возврат структураДоговор;
	

КонецФункции // ()


	
	

&НаКлиенте
Процедура Загрузить(Команда)
	
	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
	
	ЗагрузитьНаСервере(ДвоичныеДанные,Файл.Расширение);

	
	
	
	
	Сообщить("Ок");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Исполнитель=Параметры.Сотрудник;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	// Вставить содержимое обработчика.
	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("ссылкаСпр", Истина);
	
	ОповеститьОВыборе(СписокПараметров);

КонецПроцедуры
